_static/soap_outputs/6.5.314.4301/create_package_from_json_step_7_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>GetObject</command>
      <object_list>
        <package_spec>
          <expire_seconds>660</expire_seconds>
          <display_name>Disable Java Auto Update</display_name>
          <name>Disable Java Auto Update API TEST</name>
          <modification_time>2001-01-01T00:00:00</modification_time>
          <verify_expire_seconds>600</verify_expire_seconds>
          <creation_time>2001-01-01T00:00:00</creation_time>
          <verify_group_id>0</verify_group_id>
          <skip_lock_flag>0</skip_lock_flag>
          <last_update>2001-01-01T00:00:00</last_update>
          <source_id>0</source_id>
          <hidden_flag>0</hidden_flag>
          <command>cmd /c cscript //T:60 disable-java-auto-update.vbs</command>
          <command_timeout>60</command_timeout>
          <deleted_flag>0</deleted_flag>
          <available_time>2015-08-26T20:16:52</available_time>
          <id>468</id>
          <files>
            <file>
              <status>200</status>
              <bytes_total>11377</bytes_total>
              <hash>9e36208ce643c767ad76ef2ad6a69141fbb5a59a607b8eb8065db09e3a153c0d</hash>
              <id>43</id>
              <cache_status>Cached</cache_status>
              <name>disable-java-auto-update.vbs</name>
              <download_seconds>0</download_seconds>
              <bytes_downloaded>11377</bytes_downloaded>
              <source>https://content.tanium.com/files/published/InitialContent/2015-06-04_18-59-45_6.5.1.0011-ga516c3c/disable_java_auto_update/disable-java-auto-update.vbs</source>
              <last_download_progress_time>2015-08-26T20:17:02</last_download_progress_time>
              <download_start_time>2015-08-26T20:16:41</download_start_time>
              <size>11377</size>
              <file_status>
                <status>
                  <status>0</status>
                  <bytes_total>0</bytes_total>
                  <server_id>1</server_id>
                  <server_name>TPT1-0.localdomain:17472</server_name>
                  <bytes_downloaded>0</bytes_downloaded>
                  <cache_status>Processing</cache_status>
                </status>
              </file_status>
            </file>
          </files>
          <verify_group>
            <id>0</id>
          </verify_group>
          <metadata>
            <item>
              <admin_flag>0</admin_flag>
              <name>defined</name>
              <value>Tanium</value>
            </item>
            <item>
              <admin_flag>0</admin_flag>
              <name>category</name>
              <value>Tanium</value>
            </item>
          </metadata>
        </package_spec>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>